"use strict";
window.fineList = {
    searchFines : searchFines
}

//Ця зміна містить всі дані які в нас зберігаються у файлі data
let DB = data.finesData;

function searchFines(searchKey){
    /*
     Напишіть свій код тут!
     Як ви бачите функція повертає статичні дані.
     Замість масиву який прописаний хардкодом, вам необхідно реалізувати цю функцію
     так, щоб вона повертала масив відповідно переданому значенню в функцію.
     Саме значення - це "Пошук за номером" або "Пошук за типом штрафу"
     Тип штрафу може бути тільки
     - Перевищення швидкості
     - Невірне паркування
     - Їзда у не тверезому стані
     */

    let result = [];
    
    DB.forEach(fine => {
        if (fine["номер"] === searchKey || fine["тип"] === searchKey) {
            result.push(fine); 
        }
    });

    if (result.length === 0) {
        result = [{номер: 'ххх', тип: 'Нічого не знайдено', сума: 0, дата: '1970-01-01'}];
    }

    return result;
}
